src/Documents/ОперацияПоБонусномуСчету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОперацияПоБонусномуСчету</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусныеСчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БонусныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецБонусногоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Comment>Реализация</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>550</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/БонусныеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>БонусныеСчета</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БонусныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументНачисления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоБонусномуСчету</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводОстатков</Name>
					<Comment>Ввод остатков</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВзносУчредителя</Name>
					<Comment>Взнос учредителя</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОшибочнойОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСЛицевогоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВКассу</Name>
					<Comment>Для фин. операций. Отправка банком ден. средств в организацию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДивидендовУчредителю</Name>
					<Comment>ВыплатаДивидендовУчредителю</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗаработнойПлаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеСертификата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтСтраховойКомпании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеМеждуСкладами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещенияМеждуСотрудниками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСкладу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассы</Name>
					<Comment>Для фин. операций. Поступление фиксация поступления ден. средств в банк </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтЭквайера</Name>
					<Comment>Поступление от эквайера</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаНаличныхВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеБонусныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеРозничнойВыручкиИзОперационнойКассы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеИзКассыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаРозничнойВыручкиВКассуПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеВОперационнуюКассу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Лаборатория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховаяКомпания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорпоративныеКонтрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосОрган</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ОперацияПоБонусномуСчету/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураМеню = Новый Структура; 
	СтруктураМеню.Вставить("Содержание"   , "Основное");
 	СтруктураМеню.Вставить("Дополнительно", "ГруппаДополнительно");
	
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработкиСтоматология.ПриСозданииНаСервере(ЭтаФорма);
	
	ЗаполнитьПараметрыБонусногоСчетаВладельца("СозданиеФормы");	
	
	УстановитьВидимость();
	
	Если Объект.ПометкаУдаления = Истина Тогда
		Элементы.ГруппаСостояниеОбъекта.Видимость = Истина;	
		РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления, Объект.Проведен);		
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаСервере
// Процедура - обработчик события "ПослеЗаписиНаСервере".
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления, Объект.Проведен);
	
КонецПроцедуры

&НаСервере
// Процедура - обработчик события "ПриЧтенииНаСервере".
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления, Объект.Проведен);
	
	Если Объект.ПометкаУдаления = Истина Тогда
		Элементы.ГруппаСостояниеОбъекта.Видимость = Истина;	
	Иначе
		Элементы.ГруппаСостояниеОбъекта.Видимость = Ложь;	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Перед записью.
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОпераций.СписаниеБонусныйСчет") И Объект.Сумма > ОстатокБонусногоСчета Тогда
		Объект.Сумма = ОстатокБонусногоСчета;		
		Отказ = Истина;		                 
		Предупреждение("Сумма списания превышает остаток бонусного счета");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "ТумблерТипВладельцаПриИзменении".
//
Процедура ТумблерТипВладельцаПриИзменении(Элемент)

	ЗаполнитьПараметрыБонусногоСчетаВладельца("Переключатель");
	ОбновитьИнформациюПоОстаткамБС();
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ВладелецБонусногоСчетаПриИзменении".
//
Процедура ВладелецБонусногоСчетаПриИзменении(Элемент)

	ЗаполнитьПараметрыБонусногоСчетаВладельца("Владелец");
	ОбновитьИнформациюПоОстаткамБС();	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ВладелецБонусногоСчетаНачалоВыбора".
//
Процедура ВладелецБонусногоСчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ТумблерТипВладельца Тогда 
		НовыйПараметр = Новый ПараметрВыбора("Отбор.ТипКонтрагента", ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиенты"));
		НовыйМассив = Новый Массив();
		НовыйМассив.Добавить(НовыйПараметр);
		НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
		Элемент.ПараметрыВыбора = НовыеПараметры;
	Иначе 
		Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "БонусныйСчетПриИзменении".
//
Процедура БонусныйСчетПриИзменении(Элемент)

	ОбновитьИнформациюПоОстаткамБС();
	
КонецПроцедуры   

&НаКлиенте
// Процедура, выполняет обработку нажатия динамических кнопок.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура заполняет бонусные счета контрагентов.
//
Процедура ЗаполнитьПараметрыБонусногоСчетаВладельца(Знач ПолеНаФорме = "")
	
	Если ПолеНаФорме = "Владелец" Тогда 
		
		БонусныеСчетаВладельца = Справочники.БонусныеСчета.ВернутьБонусныеСчетаВладельца(Объект.ВладелецБонусногоСчета, Объект.Дата);		
		Если БонусныеСчетаВладельца.Количество() = 1 Тогда 
			Объект.БонусныйСчет = БонусныеСчетаВладельца[0];
		КонецЕсли;
		
	ИначеЕсли ПолеНаФорме = "Переключатель" Тогда
		
		Если ТумблерТипВладельца Тогда 
			Объект.ВладелецБонусногоСчета = Справочники.Карты.ПустаяСсылка();
		Иначе 
			Объект.ВладелецБонусногоСчета = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		Объект.БонусныйСчет = Справочники.БонусныеСчета.ПустаяСсылка();
		
	ИначеЕсли ПолеНаФорме = "СозданиеФормы" Тогда 
		
		Если Объект.Проведен Тогда 
			ПереключитьТумблер(Объект.ВладелецБонусногоСчета, ТумблерТипВладельца);
		Иначе
			Если ЗначениеЗаполнено(Объект.ВладелецБонусногоСчета) Тогда
				ПереключитьТумблер(Объект.ВладелецБонусногоСчета, ТумблерТипВладельца);
				Если Объект.Ссылка.Пустая() Тогда
					ЗаполнитьПараметрыБонусногоСчетаВладельца("Владелец");
				Иначе 
					БонусныеСчетаВладельца = Справочники.БонусныеСчета.ВернутьБонусныеСчетаВладельца(Объект.ВладелецБонусногоСчета, Объект.Дата);
					Если ЗначениеЗаполнено(Объект.БонусныйСчет) Тогда 
						Если БонусныеСчетаВладельца.Найти(Объект.БонусныйСчет) = Неопределено Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru= 'На текущую дату документа бонусный счет клиента уже не актуален!';en ='As of the current date of the document, the client’s bonus account is no longer relevant!'"), Объект.Ссылка, "Объект.БонусныйСчет"); 
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;	
			Иначе 
				ЗаполнитьПараметрыБонусногоСчетаВладельца("Переключатель");				
			КонецЕсли;	
		КонецЕсли;
		
	КонецЕсли;		
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура осуществляет управление тумблером.
//
Процедура ПереключитьТумблер(Знач ВладелецБонусногоСчета, ТумблерТипВладельца)

	Если ТипЗнч(ВладелецБонусногоСчета) = Тип("СправочникСсылка.Контрагенты") Тогда 
		ТумблерТипВладельца = Ложь;
	ИначеЕсли ТипЗнч(ВладелецБонусногоСчета) = Тип("СправочникСсылка.Карты") Тогда 
		ТумблерТипВладельца = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура обновляет информацию по остаткам на бонусном счете клиента. 
//
Процедура ОбновитьИнформациюПоОстаткамБС()	
	
	ДатаОстатков = ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДатаСеанса());
	ОстатокБонусногоСчета = РегистрыНакопления.БонусныеСчета.ПолучитьОстатокНаБонусномСчетеВладельца(Объект.БонусныйСчет, ДатаОстатков);	
	// Декорация остатка бонусного счета
	Элементы.ДекорацияОстаткиНаБонусномСчете.Заголовок	= Формат(ОстатокБонусногоСчета, "ЧЦ=15; ЧДЦ=2; ЧН=")
															+ " " + ОбщегоНазначенияСтоматология.ПолучитьСимвольныйКодИспользуемойВалютыЦелойЧасти();
	Элементы.ДекорацияОстаткиНаБонусномСчете.ЦветТекста = ?(ОстатокБонусногоСчета < 0, WebЦвета.Красный, ЦветаСтиля.ПоясняющийТекст);
	
КонецПроцедуры

&НаСервере
// Процедура - устанавливает видимость реквизитов в зависимости от вида операции.
//
Процедура УстановитьВидимость()
	
	Элементы.Шапка.ТолькоПросмотр		= Объект.Проведен; 
	Элементы.Основное.ТолькоПросмотр 	= Объект.Проведен;
	
	ЭтаФорма.Заголовок = "";
	// Установка первой части заголовка по типу операции
	Если Объект.ВидОперации = Перечисления.ВидыОпераций.НачислениеБонусныйСчет Тогда
		ЭтаФорма.Заголовок = НСтр("ru= 'Взнос на бонусный счет';en ='Bonus account contribution'");
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОпераций.СписаниеБонусныйСчет Тогда
		ЭтаФорма.Заголовок = НСтр("ru= 'Списание с бонусного счета';en ='Withdrawal from the bonus account'");
	Иначе
		ЭтаФорма.Заголовок = НСтр("ru= 'Операция по бонусному счету';en ='Bonus account operation'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + НСтр("ru= ' (создание)';en =' (creation)'");
	Иначе 
		ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " №" + Объект.Номер + НСтр("ru= ' от ';en =' from '") + Формат(Объект.Дата, "ДЛФ=DDT");
	КонецЕсли;
	
	Если ТумблерТипВладельца Тогда 
		Элементы.ВладелецБонусногоСчета.ПодсказкаВвода = НСтр("ru= 'Карта';en ='Card'");
	Иначе 
		Элементы.ВладелецБонусногоСчета.ПодсказкаВвода = НСтр("ru= 'Пациент';en ='Client'");
	КонецЕсли;	
	
	Элементы.Основание.Видимость = ЗначениеЗаполнено(Объект.Основание);
	
	ОбновитьИнформациюПоОстаткамБС();
		
КонецПроцедуры 


#КонецОбласти
